#+Title: Exceptions and File IO
#+Author: Mikael Svahnberg
#+Email: Mikael.Svahnberg@bth.se
#+Date: 2023-10-02
#+EPRESENT_FRAME_LEVEL: 1
#+OPTIONS: email:t <:t todo:t f:t ':t H:2
#+STARTUP: beamer

#+LATEX_CLASS_OPTIONS: [10pt,t,a4paper]
#+BEAMER_THEME: BTH_msv

* Exception Handling
#+begin_src java :file Document.java :imports java.util.ArrayList
  public class Document {
    private ArrayList<String> contents = new ArrayList<>();
    Document() { }

    // We handle any error (by not doing anything)
    // and return false. The 
    public boolean addLine(int position, String text) {
      if ( true /* can line be added */) {
        contents.add(position, text);
        return true; // The line was added
      } else {
        return false; // The line was not added
      }
    }

    // If we throw an exception, we can use an informative class
    // so that the error can be handled in our system
    // AND we can give a good error message so that the developers
    // will know what happened.
    // There is no longer any need for a return value.
    public void removeLine(int position) {
      if (position > contents.size()) {
        throw new IndexOutOfBoundsException("Trying to remove a line outside Document bounds");
      } else {
        contents.remove(position);
      }
    }

    public static void main(String [] args) {
      Document d = new Document();
      d.addLine(0, "Hello World"); // I do not need to handle the return value
      try {
        d.removeLine(99);
      } catch(IndexOutOfBoundsException e) {
        // This is the specific error message we know we might get
        System.out.println(e.getMessage());
      } catch(Exception e) {
        // Any other error message we might get. We don't want the programme
        // to terminate, so we catch, print, and move on.
        System.out.println(e.getMessage());
      } finally {
        // Cleanup regardless of whether there was an error or not
        System.out.println("Tried to remove a line");
      }

      try {
        d.removeLine(1);
        System.out.println("This line will not be executed");
      } catch(Exception e) {
      } finally {
        System.out.println("But this one will");
      }

    }
  }
#+end_src

#+RESULTS:
: Trying to remove a line outside Document bounds
: Tried to remove a line
: But this one will
* File Input in Java
- ~java.io.FileReader~ ?
  - Only has one method to read a single character.
  - ~java.io.BufferedReader~ to get ~readLine()~ method

- Two ways here too. One old-school and one newer.
- As usual, there are many other ways too.

#+begin_src java :file Inputter.java
  import java.io.FileReader;
  import java.io.BufferedReader;
  import java.nio.file.*;
  import java.util.ArrayList;

  public class Inputter {

    public ArrayList<String> oldSchool(String filename) {
      ArrayList<String> contents = new ArrayList<String>();
      try (
        FileReader file = new FileReader(filename);
        BufferedReader buf = new BufferedReader(file);
        ) {
        String line;
        while ((line = buf.readLine()) != null) {
          contents.add(line);
        }
      } catch (IOException e) {
        System.out.println(e);
      }

      return contents;
    }

    public ArrayList<String> hipster(String filename) {
      ArrayList<String> contents = new ArrayList<String>();
      Path path = Paths.get(filename);

      try(BufferedReader buf = Files.newBufferedReader(path)) {
        String line;
        while ((line = buf.readLine()) != null) {
          contents.add(line);
        }
      } catch (IOException e) {
        System.out.println(e);        
      }

      return contents;
    }

    public static void main(String [] args) {
      Inputter in = new Inputter();
      ArrayList<String> contents;

      contents = in.oldSchool("tst.txt");
      for (String l : contents) { System.out.println(l); }

      contents = in.hipster("tst2.txt");
      for (String l : contents) { System.out.println(l); }

    }
  }

#+end_src

#+RESULTS:
: Some text
: Some more text
: Some preferred text

